---
type: StructuralSectionRoundHSS
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionRoundHSS

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundHSS` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionRoundHSS | 2015 | `public StructuralSectionRoundHSS ( double diameter , double wallNominalThickness , double wallDesignThickness , double centroidHorizontal , double centroidVertical , double principalAxesAngle , double sectionArea , doubl` |